mbardwell/rstrap/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_nus/Src/main.c
    bma_wake();

    bma_sample(&sample);
    NRF_LOG_INFO("accel -- x: %d, y: %d, z: %d", sample.x, sample.y, sample.z);

    prepare_accel_for_nus(sample.x, sample_in_ascii, NUS_ACCEL_X_TAG);
    actual_number_of_digits = number_of_digits(abs(sample.x)) + 3; // NUS_TAG, command tag and sign byte
    send_over_nus(sample_in_ascii, &actual_number_of_digits);

    prepare_accel_for_nus(sample.y, sample_in_ascii, NUS_ACCEL_Y_TAG);
    actual_number_of_digits = number_of_digits(abs(sample.y)) + 3;
    send_over_nus(sample_in_ascii, &actual_number_of_digits);

    prepare_accel_for_nus(sample.z, sample_in_ascii, NUS_ACCEL_Z_TAG);
    actual_number_of_digits = number_of_digits(abs(sample.z)) + 3;
    send_over_nus(sample_in_ascii, &actual_number_of_digits);

    bma_sleep();
}

static void nus_update_battery_voltage(void)
{
    int16_t voltage;
    static uint16_t max_n_ascii_characters = 1+1+4; // Byte order: nus tag, command, four digits for milli-voltage
    uint8_t voltage_in_ascii[max_n_ascii_characters];

    battery_level_in_mv(&voltage);
    NRF_LOG_INFO("sending battery voltage in mV: %d", voltage);

    if (voltage > 9999 || voltage < 1000)
    {
        NRF_LOG_WARNING("voltage outside of 4 digit bound. Not sent over nus");
        return;
    }

    voltage_in_ascii[0] = NUS_BATTERY_TAG;
    voltage_in_ascii[1] = UPDATE;
    __itoa(voltage, (char*) voltage_in_ascii+2, 10);
    send_over_nus(voltage_in_ascii, &max_n_ascii_characters);
}

static void nus_update_temperature(void)
{
    static int32_t temperature;
    static uint8_t sign = 0x2B; // sign is default + in ascii
    static uint16_t max_n_ascii_characters = 1+1+1+2; // Byte order: nus tag, command, sign (+/-), two digits for temperature
    uint8_t temperature_in_ascii[max_n_ascii_characters];

    temperature_sample(&temperature); // returns temperature in celcius
    NRF_LOG_INFO("sending temperature measurement: %d", temperature);
    if (temperature > 99 || temperature < -99)
    {
        NRF_LOG_WARNING("temperature exceeds two-digit bound. Not sent over nus");
        return;
    }
    else if (temperature < 0)
    {
        sign = 0x2D;
        temperature = abs(temperature);
    }
    
    temperature_in_ascii[0] = NUS_TEMP_TAG;
    temperature_in_ascii[1] = UPDATE;
    temperature_in_ascii[2] = sign;
    __itoa(temperature, (char*) temperature_in_ascii+3, 10);
    send_over_nus(temperature_in_ascii, &max_n_ascii_characters);
}

static void nus_update_tension(void)
{
    hx711_start();
}

void nus_update_tension_callback(uint32_t* tension)
{
    uint16_t max_n_ascii_characters = 1+1+8; // Byte order: nus tag, update tag, eight digits for maximum tension reading
    uint8_t tension_in_ascii[max_n_ascii_characters];

    NRF_LOG_INFO("sending tension: %d", *tension);


    uint32_t temp_tension = *tension;
    uint16_t count = 2;
    // at minimum send the nus tag and one digit
    if (temp_tension == 0)
    {
        count++; // if tension is already 0, add a byte to represent the "0" digit
    }
    while (temp_tension != 0)
    {
        temp_tension /= 10;
        count++;
    }

    tension_in_ascii[0] = NUS_TENSION_TAG;
    tension_in_ascii[1] = UPDATE;
    __itoa(*tension, (char*) tension_in_ascii+2, 10);
    send_over_nus(tension_in_ascii, &count);
}

void nus_tension_alert()
{
    uint8_t alert[2];
    alert[0] = NUS_TENSION_TAG;
    alert[1] = ALERT;
    uint16_t len = 2;

    send_over_nus(alert, &len);
}

/**@brief Functions for handling the timer timeouts.
 *
 * @details This function will be called each time a timer expires.
 *
 * @param[in] p_context   Pointer used for passing some arbitrary information (context) from the
 *                        app_start_timer() call to the timeout handler.
 */
static void accel_timer_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);
    accel_level_update_flag = true;
}

static void battery_timer_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_level_update_flag = true;
}

static void temp_timer_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);
    temp_level_update_flag = true;
}

static void tension_timer_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);
    tension_level_update_flag = true;
}

static void blink_timer_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);
    static bool blink_high = false;
    if (blink_high)
    {
        nrf_gpio_pin_clear(ADVERTISEMENT_LED);
        blink_high = false;
    }
    else
    {
        nrf_gpio_pin_set(ADVERTISEMENT_LED);
        blink_high = true;
    }
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    ret_code_t err_code;

    // Initialize timer module.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create timers.
    err_code = app_timer_create(&m_accel_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                accel_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_battery_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_tension_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                tension_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_temp_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                temp_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);
    err_code = app_timer_create(&m_blinkled_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                blink_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t err_code;
    ble_gap_conn_params_t gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_GENERIC_THERMOMETER);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t *p_gatt, nrf_ble_gatt_evt_t const *p_evt)
{
    if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
    {
        m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
        NRF_LOG_INFO("data len is set to 0x%X(%d)", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
    }
    NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
                  p_gatt->att_mtu_desired_central,
                  p_gatt->att_mtu_desired_periph);
}

/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t *p_evt)
{
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t length = p_evt->params.rx_data.length;
        uint8_t nus_tag_byte = *p_evt->params.rx_data.p_data;
        uint8_t command_byte = *(p_evt->params.rx_data.p_data + 1);
        uint8_t ascii_char;
        int32_t data = NUS_RX_ERROR;
        for (uint32_t i=0; i < length-2; ++i)
        {
            if (i == 0)
            {
                data = NUS_RX_INIT; // because data should equal NUS_RX_ERROR unless it enters this loop
            }
            ascii_char = *(p_evt->params.rx_data.p_data+2+i);
            if (ascii_char < '0' || ascii_char > '9')
            {
                NRF_LOG_WARNING("data byte received is not an ascii number");
                data = NUS_RX_ERROR; // reset data to NUS_RX_ERROR in case previous ascii chars were valid
                break;
            }
            data = data * 10 + (ascii_char - '0');
        }

        NRF_LOG_INFO("server recieved package of length %d bytes with nus_tag_byte 0x%x, command byte 0x%x, data %d",
        p_evt->params.rx_data.length,
        nus_tag_byte,
        command_byte,
        data);

        switch (nus_tag_byte)
        {
            case NUS_BATTERY_TAG:
                if (command_byte == UPDATE)
                {
                    nus_update_battery_voltage();
                }
                break;
            
            case NUS_TEMP_TAG:
                if (command_byte == UPDATE)
                {
                    nus_update_temperature();
                }
                break;
            
            case NUS_TENSION_TAG:
                if (command_byte == SET)
                {
                    if (data != NUS_RX_ERROR && data < 100 && data > 0)
                    {
                        lock_in_tension_threshold(data);
                    }
                    else
                    {
                        NRF_LOG_INFO("using default safety factor to set threshold. %d percent",
                        DEFAULT_SAFETY_FACTOR_IN_PERCENT);
                        lock_in_tension_threshold(DEFAULT_SAFETY_FACTOR_IN_PERCENT);
                    }
                }
                break;

            case NUS_SHUTDOWN_TAG:
                sleep_mode_enter();
                break;

            default:
                NRF_LOG_WARNING("nus tag byte not a recognized switch case");
                break;
        }
    }
}

/**@brief Function for initializing bluetooth services
 */
static void services_init(void)
{
    ret_code_t err_code;
    ble_dis_init_t dis_init;
    nrf_ble_qwr_init_t qwr_init = {0};
    ble_nus_init_t nus_init;

